{"format":"layers-model","generatedBy":"keras v3.10.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"class_name":"Sequential","config":{"name":"yele_chord_model","trainable":true,"dtype":"float32","layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"name":"input_layer","batchInputShape":[null,63]}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":"float32","rate":0.2,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":"float32","units":9,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}]}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"yele_chord_model/dense/kernel","shape":[63,256],"dtype":"float32"},{"name":"yele_chord_model/dense/bias","shape":[256],"dtype":"float32"},{"name":"yele_chord_model/dense_1/kernel","shape":[256,128],"dtype":"float32"},{"name":"yele_chord_model/dense_1/bias","shape":[128],"dtype":"float32"},{"name":"yele_chord_model/dense_2/kernel","shape":[128,64],"dtype":"float32"},{"name":"yele_chord_model/dense_2/bias","shape":[64],"dtype":"float32"},{"name":"yele_chord_model/dense_3/kernel","shape":[64,9],"dtype":"float32"},{"name":"yele_chord_model/dense_3/bias","shape":[9],"dtype":"float32"}]}]}